backend/tests/load-tests/api-load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 5
    - name: "Ramp up load"
      duration: 60
      arrivalRate: 5
      rampTo: 50
    - name: "Sustained load"
      duration: 120
      arrivalRate: 50
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 1000
  ensure:
    thresholds:
      - http.response_time.p95: 2000
      - http.response_time.p99: 4000
      - http.response_time.max: 10000
      - http.codes.2xx: 95
  payload:
    path: "test-data.json"
    fields:
      - "userId"
      - "token"

scenarios:
  - name: "Health check"
    weight: 5
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  - name: "User-related operations"
    weight: 30
    flow:
      - get:
          url: "/api/user/profile"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/user/wallet"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Game and companion browsing"
    weight: 25
    flow:
      - get:
          url: "/api/games"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/companions"
          qs:
            page: 1
            pageSize: 10
          expect:
            - statusCode: 200

  - name: "Circle and post browsing"
    weight: 20
    flow:
      - get:
          url: "/api/posts"
          qs:
            page: 1
            pageSize: 20
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/tags"
          expect:
            - statusCode: 200

  - name: "Gift and payment related"
    weight: 10
    flow:
      - get:
          url: "/api/gifts"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/vip/packages"
          expect:
            - statusCode: 200

  - name: "Chat operations"
    weight: 10
    flow:
      - get:
          url: "/api/chat/rooms"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - think: 3